
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.service_main will be created
  + resource "google_cloud_run_v2_service" "service_main" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + name                    = "edup92vault-service-main"
      + observed_generation     = (known after apply)
      + project                 = "fluted-result-476220-j1"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "vaultwarden/server:latest"

              + env {
                  + name  = "DOMAIN"
                  + value = "https://vault.edup92mail.xyz"
                }
              + env {
                  + name  = "ROCKET_PORT"
                  + value = "80"
                }
              + env {
                  + name  = "ROCKET_ADDRESS"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "SIGNUPS_ALLOWED"
                  + value = "false"
                }
              + env {
                  + name  = "INVITATIONS_ALLOWED"
                  + value = "false"
                }
              + env {
                  + name  = "WEBSOCKET_ENABLED"
                  + value = "true"
                }
              + env {
                  + name  = "WEB_VAULT_ENABLED"
                  + value = "true"
                }
              + env {
                  + name  = "ADMIN_TOKEN"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "TZ"
                  + value = "Europe/Madrid"
                }
              + env {
                  + name  = "SMTP_HOST"
                  + value = "smtp.gmail.com"
                }
              + env {
                  + name  = "SMTP_FROM"
                  + value = "edup92mail@gmail.com"
                }
              + env {
                  + name  = "SMTP_PORT"
                  + value = "587"
                }
              + env {
                  + name  = "SMTP_SECURITY"
                  + value = "starttls"
                }
              + env {
                  + name  = "SMTP_USERNAME"
                  + value = "edup92mail@gmail.com"
                }
              + env {
                  + name  = "SMTP_PASSWORD"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "DATABASE_URL"
                  + value = (sensitive value)
                }

              + liveness_probe (known after apply)

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "0.25"
                      + "memory" = "256Mi"
                    }
                }

              + startup_probe (known after apply)

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = (known after apply)
                }
            }
        }

      + traffic (known after apply)
    }

  # google_compute_disk_resource_policy_attachment.disk_policy_attachment will be created
  + resource "google_compute_disk_resource_policy_attachment" "disk_policy_attachment" {
      + disk    = "edup92vault-disk-main"
      + id      = (known after apply)
      + name    = "edup92vault-snapshot-main"
      + project = "fluted-result-476220-j1"
      + zone    = "europe-southwest1-a"
    }

  # google_sql_database.sqldb_main will be created
  + resource "google_sql_database" "sqldb_main" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "edup92vault-sql-main"
      + name            = "db_vault"
      + project         = (known after apply)
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.sql_main will be created
  + resource "google_sql_database_instance" "sql_main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "edup92vault-sql-main"
      + private_ip_address             = (known after apply)
      + project                        = "fluted-result-476220-j1"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings (known after apply)
            }

          + ip_configuration (known after apply)

          + location_preference (known after apply)
        }
    }

  # google_sql_user.sqluser_main will be created
  + resource "google_sql_user" "sqluser_main" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "edup92vault-sql-main"
      + name                    = "user_vault"
      + password                = (sensitive value)
      + project                 = (known after apply)
      + sql_server_user_details = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
